html/fonts.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Formes spéciales permettant l'importation de fontes graphiques</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-02-02 15:42:31 EST"/>
<meta name="author" content=""/>
<link rel="stylesheet" type="text/css" href="style.css" />
</head><body>
<h1 class="title">Formes spéciales permettant l'importation de fontes graphiques</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Sprites </a></li>
<li><a href="#sec-2">2 Fontes </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Sprites </h2>
<div id="text-1">

<p>Nous avons voulu initialement utiliser des "sprites" afin de
pouvoir représenter visuellement les objets du jeu. Ainsi, nous
voulions pouvoir charger à partir de fichiers d'images les
représentations visuelles des objets et de pouvoir les afficher sur
demande.
</p>
<p>
Cette idée fonctionnait assez bien initialement, mais quelques
problèmes sont survenus qui ont fait évoluer l'idée. En effet,
puisque les objets dans space-invaders sont animés (même si c'est
très limité), plusieurs images sont nécessaire, pour chaque type
d'objets. Il en résulte donc en une explosion de la quantité de
fichiers d'images à utiliser. De plus, il serait ingérable
d'utiliser ce système afin de pouvoir afficher du text à l'écran.
</p>
<p>
Ainsi, l'idée d'utiliser des fontes est venue naturellement par
elle-même.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Fontes </h2>
<div id="text-2">

<p>Donc avec les fontes, toutes images décrivant un objet se retrouve
dans une meta-image qui contiendra toutes les autres images pouvant
représenter cette objet. Ensuite, lorsque la fontes est chargée
(lors de la compilation ou l'exécution du programme) ces images sont
stockées dans des tableaux C, via du code généré par la macro de
création de fontes.
</p></div>
</div>
<div id="postamble"><p class="author"> Author: 
<a href="mailto:dave@david-laptop">&lt;dave@david-laptop&gt;</a>
</p>
<p class="date"> Date: 2009-02-02 15:42:31 EST</p>
<p>HTML generated by org-mode 6.21a in emacs 22</p>
</div></body>
</html>
